In [2]:
import pandas as pd

## Quick Object Conversions

In [3]:
baby_names = pd.read_csv("https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv")
baby_names.head(3)

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42

## Export `DataFrame` to CSV File with the `.to_csv()` Method

In [3]:
baby_names = pd.read_csv("https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv")
baby_names.head(3)

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42

In [4]:
baby_names.to_csv("Baby Names.csv", index = False, columns = ["Year of Birth", "Count"], encoding = "utf-8")

## Import Excel File

In [4]:
df = pd.read_excel("Data - Single Worksheet.xlsx")
df

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [12]:
data = pd.read_excel("Data - Multiple Worksheets.xlsx")

In [13]:
type(data)

pandas.core.frame.DataFrame

In [14]:
data

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

## Export Excel File

In [30]:
baby_names = pd.read_csv("https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv")
baby_names.head(3)

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Olivia,172,1
1,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Chloe,112,2
2,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Sophia,104,3

In [31]:
popular = baby_names[baby_names["Count"] >= 100]
unpopular = baby_names[baby_names["Count"] < 100]

In [32]:
excel_file = pd.ExcelWriter("Baby Name Frequency.xlsx")

In [33]:
popular.to_excel(excel_file, sheet_name = "Popular Names", index = False)
unpopular.to_excel(excel_file, sheet_name = "Unpopular Names", index = False, columns = ["Child's First Name", "Count"])

In [34]:
excel_file.save()

## Export Excel File

In [35]:
URL = "https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv"
baby_names = pd.read_csv(URL)
baby_names.head(3)

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Olivia,172,1
1,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Chloe,112,2
2,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Sophia,104,3

In [37]:
girls = baby_names[baby_names["Gender"] == "FEMALE"]
boys = baby_names[baby_names["Gender"] == "MALE"]

In [38]:
excel_file = pd.ExcelWriter("Baby Names.xlsx")

In [39]:
girls.to_excel(excel_file, sheet_name = "Girls", index = False)
boys.to_excel(excel_file, sheet_name = "Boys", index = False)

In [40]:
excel_file.save()